; domain
(define (domain typed-sokoban)
(:requirements :typing)
(:types LOC DIR BOX)
(:predicates 
             (at-robot ?l - LOC)
             (at ?o - BOX ?l - LOC)
             (adjacent ?l1 - LOC ?l2 - LOC ?d - DIR) 
             (clear ?l - LOC)
)


(:action move
:parameters (?from - LOC ?to - LOC ?dir - DIR)
:precondition (and (clear ?to) (at-robot ?from) (adjacent ?from ?to ?dir))
:effect (and (at-robot ?to) (not (at-robot ?from)))
)
             

(:action push
:parameters  (?rloc - LOC ?bloc - LOC ?floc - LOC ?dir - DIR ?b - BOX)
:precondition (and (at-robot ?rloc) (at ?b ?bloc) (clear ?floc)
	           (adjacent ?rloc ?bloc ?dir) (adjacent ?bloc ?floc ?dir))

:effect (and (at-robot ?bloc) (at ?b ?floc) (clear ?bloc)
             (not (at-robot ?rloc)) (not (at ?b ?bloc)) (not (clear ?floc)))
)
)

; problem
;In guarantee_solution():
;Planning path: 0
;In plan_path():
;In put_box: 
;length of path: 9
;Planning path: 1
;In plan_path():
;In put_box: 
;length of path: 16
;In set_wall_mask(): 
;In clear_box_neighborhood(): 
;In enforce_direction_constraints(): 
;In setup_walls(): 
;Grid: 

; 8 8 8 8 8 8 8 
; 0 8 2 8 8 8 8 
; 8 8 8 8 8 8 8 
; 8 8 8 8 2 8 8 
; 8 8 8 3 8 8 8 
; 8 8 8 8 8 3 1 
; 8 8 3 8 8 3 1 

;Wall mask: 

; 0 1 0 1 1 0 0 
; 0 0 0 0 0 0 0 
; 0 0 0 0 0 0 0 
; 0 0 0 0 0 0 0 
; 0 0 0 1 0 0 0 
; 0 0 0 0 0 0 0 
; 0 1 1 0 0 0 0 




(define (problem typed-sokoban-grid7-boxes2-walls4)
(:domain typed-sokoban)
(:objects 
        up down left right - DIR
        box0 box1 - BOX
        f0-0f f0-1f f0-2f f0-3f f0-4f f0-5f f0-6f 
        f1-0f f1-1f f1-2f f1-3f f1-4f f1-5f f1-6f 
        f2-0f f2-1f f2-2f f2-3f f2-4f f2-5f f2-6f 
        f3-0f f3-1f f3-2f f3-3f f3-4f f3-5f f3-6f 
        f4-0f f4-1f f4-2f f4-3f f4-4f f4-5f f4-6f 
        f5-0f f5-1f f5-2f f5-3f f5-4f f5-5f f5-6f 
        f6-0f f6-1f f6-2f f6-3f f6-4f f6-5f f6-6f  - LOC
)
(:init
(adjacent f0-0f f0-1f right)
(adjacent f0-0f f1-0f down)
(adjacent f0-1f f0-0f left)
(adjacent f0-1f f0-2f right)
(adjacent f0-1f f1-1f down)
(adjacent f0-2f f0-1f left)
(adjacent f0-2f f0-3f right)
(adjacent f0-2f f1-2f down)
(adjacent f0-3f f0-2f left)
(adjacent f0-3f f0-4f right)
(adjacent f0-3f f1-3f down)
(adjacent f0-4f f0-3f left)
(adjacent f0-4f f0-5f right)
(adjacent f0-4f f1-4f down)
(adjacent f0-5f f0-4f left)
(adjacent f0-5f f0-6f right)
(adjacent f0-5f f1-5f down)
(adjacent f0-6f f0-5f left)
(adjacent f0-6f f1-6f down)
(adjacent f1-0f f1-1f right)
(adjacent f1-0f f0-0f up)
(adjacent f1-0f f2-0f down)
(adjacent f1-1f f1-0f left)
(adjacent f1-1f f1-2f right)
(adjacent f1-1f f0-1f up)
(adjacent f1-1f f2-1f down)
(adjacent f1-2f f1-1f left)
(adjacent f1-2f f1-3f right)
(adjacent f1-2f f0-2f up)
(adjacent f1-2f f2-2f down)
(adjacent f1-3f f1-2f left)
(adjacent f1-3f f1-4f right)
(adjacent f1-3f f0-3f up)
(adjacent f1-3f f2-3f down)
(adjacent f1-4f f1-3f left)
(adjacent f1-4f f1-5f right)
(adjacent f1-4f f0-4f up)
(adjacent f1-4f f2-4f down)
(adjacent f1-5f f1-4f left)
(adjacent f1-5f f1-6f right)
(adjacent f1-5f f0-5f up)
(adjacent f1-5f f2-5f down)
(adjacent f1-6f f1-5f left)
(adjacent f1-6f f0-6f up)
(adjacent f1-6f f2-6f down)
(adjacent f2-0f f2-1f right)
(adjacent f2-0f f1-0f up)
(adjacent f2-0f f3-0f down)
(adjacent f2-1f f2-0f left)
(adjacent f2-1f f2-2f right)
(adjacent f2-1f f1-1f up)
(adjacent f2-1f f3-1f down)
(adjacent f2-2f f2-1f left)
(adjacent f2-2f f2-3f right)
(adjacent f2-2f f1-2f up)
(adjacent f2-2f f3-2f down)
(adjacent f2-3f f2-2f left)
(adjacent f2-3f f2-4f right)
(adjacent f2-3f f1-3f up)
(adjacent f2-3f f3-3f down)
(adjacent f2-4f f2-3f left)
(adjacent f2-4f f2-5f right)
(adjacent f2-4f f1-4f up)
(adjacent f2-4f f3-4f down)
(adjacent f2-5f f2-4f left)
(adjacent f2-5f f2-6f right)
(adjacent f2-5f f1-5f up)
(adjacent f2-5f f3-5f down)
(adjacent f2-6f f2-5f left)
(adjacent f2-6f f1-6f up)
(adjacent f2-6f f3-6f down)
(adjacent f3-0f f3-1f right)
(adjacent f3-0f f2-0f up)
(adjacent f3-0f f4-0f down)
(adjacent f3-1f f3-0f left)
(adjacent f3-1f f3-2f right)
(adjacent f3-1f f2-1f up)
(adjacent f3-1f f4-1f down)
(adjacent f3-2f f3-1f left)
(adjacent f3-2f f3-3f right)
(adjacent f3-2f f2-2f up)
(adjacent f3-2f f4-2f down)
(adjacent f3-3f f3-2f left)
(adjacent f3-3f f3-4f right)
(adjacent f3-3f f2-3f up)
(adjacent f3-3f f4-3f down)
(adjacent f3-4f f3-3f left)
(adjacent f3-4f f3-5f right)
(adjacent f3-4f f2-4f up)
(adjacent f3-4f f4-4f down)
(adjacent f3-5f f3-4f left)
(adjacent f3-5f f3-6f right)
(adjacent f3-5f f2-5f up)
(adjacent f3-5f f4-5f down)
(adjacent f3-6f f3-5f left)
(adjacent f3-6f f2-6f up)
(adjacent f3-6f f4-6f down)
(adjacent f4-0f f4-1f right)
(adjacent f4-0f f3-0f up)
(adjacent f4-0f f5-0f down)
(adjacent f4-1f f4-0f left)
(adjacent f4-1f f4-2f right)
(adjacent f4-1f f3-1f up)
(adjacent f4-1f f5-1f down)
(adjacent f4-2f f4-1f left)
(adjacent f4-2f f4-3f right)
(adjacent f4-2f f3-2f up)
(adjacent f4-2f f5-2f down)
(adjacent f4-3f f4-2f left)
(adjacent f4-3f f4-4f right)
(adjacent f4-3f f3-3f up)
(adjacent f4-3f f5-3f down)
(adjacent f4-4f f4-3f left)
(adjacent f4-4f f4-5f right)
(adjacent f4-4f f3-4f up)
(adjacent f4-4f f5-4f down)
(adjacent f4-5f f4-4f left)
(adjacent f4-5f f4-6f right)
(adjacent f4-5f f3-5f up)
(adjacent f4-5f f5-5f down)
(adjacent f4-6f f4-5f left)
(adjacent f4-6f f3-6f up)
(adjacent f4-6f f5-6f down)
(adjacent f5-0f f5-1f right)
(adjacent f5-0f f4-0f up)
(adjacent f5-0f f6-0f down)
(adjacent f5-1f f5-0f left)
(adjacent f5-1f f5-2f right)
(adjacent f5-1f f4-1f up)
(adjacent f5-1f f6-1f down)
(adjacent f5-2f f5-1f left)
(adjacent f5-2f f5-3f right)
(adjacent f5-2f f4-2f up)
(adjacent f5-2f f6-2f down)
(adjacent f5-3f f5-2f left)
(adjacent f5-3f f5-4f right)
(adjacent f5-3f f4-3f up)
(adjacent f5-3f f6-3f down)
(adjacent f5-4f f5-3f left)
(adjacent f5-4f f5-5f right)
(adjacent f5-4f f4-4f up)
(adjacent f5-4f f6-4f down)
(adjacent f5-5f f5-4f left)
(adjacent f5-5f f5-6f right)
(adjacent f5-5f f4-5f up)
(adjacent f5-5f f6-5f down)
(adjacent f5-6f f5-5f left)
(adjacent f5-6f f4-6f up)
(adjacent f5-6f f6-6f down)
(adjacent f6-0f f6-1f right)
(adjacent f6-0f f5-0f up)
(adjacent f6-1f f6-0f left)
(adjacent f6-1f f6-2f right)
(adjacent f6-1f f5-1f up)
(adjacent f6-2f f6-1f left)
(adjacent f6-2f f6-3f right)
(adjacent f6-2f f5-2f up)
(adjacent f6-3f f6-2f left)
(adjacent f6-3f f6-4f right)
(adjacent f6-3f f5-3f up)
(adjacent f6-4f f6-3f left)
(adjacent f6-4f f6-5f right)
(adjacent f6-4f f5-4f up)
(adjacent f6-5f f6-4f left)
(adjacent f6-5f f6-6f right)
(adjacent f6-5f f5-5f up)
(adjacent f6-6f f6-5f left)
(adjacent f6-6f f5-6f up)
(at box0 f1-2f) 
(at box1 f3-4f) 
(clear f0-0f) 
(clear f0-1f) 
(clear f0-2f) 
(clear f0-3f) 
(clear f0-4f) 
(clear f0-5f) 
(clear f0-6f) 
(at-robot f1-0f) 
(clear f1-0f) 
(clear f1-1f) 
(clear f1-3f) 
(clear f1-4f) 
(clear f1-5f) 
(clear f1-6f) 
(clear f2-0f) 
(clear f2-1f) 
(clear f2-2f) 
(clear f2-3f) 
(clear f2-4f) 
(clear f2-5f) 
(clear f2-6f) 
(clear f3-0f) 
(clear f3-1f) 
(clear f3-2f) 
(clear f3-3f) 
(clear f3-5f) 
(clear f3-6f) 
(clear f4-0f) 
(clear f4-1f) 
(clear f4-2f) 
(clear f4-4f) 
(clear f4-5f) 
(clear f4-6f) 
(clear f5-0f) 
(clear f5-1f) 
(clear f5-2f) 
(clear f5-3f) 
(clear f5-4f) 
(clear f5-6f) 
(clear f6-0f) 
(clear f6-1f) 
(clear f6-3f) 
(clear f6-4f) 
(clear f6-6f) 
)
(:goal
(and
(at box0 f5-6f) 
(at box1 f6-6f) 
)
)
)


;clearing memory:

; plan
1. (move f1-0f f1-1f right)
   deleted: (at-robot f1-0f)
   added: (at-robot f1-1f)
   goals met: 0 of 2
2. (push f1-1f f1-2f f1-3f right box0)
   deleted: (at-robot f1-1f) (at box0 f1-2f) (clear f1-3f)
   added: (at-robot f1-2f) (at box0 f1-3f) (clear f1-2f)
   goals met: 0 of 2
3. (push f1-2f f1-3f f1-4f right box0)
   deleted: (at-robot f1-2f) (at box0 f1-3f) (clear f1-4f)
   added: (at-robot f1-3f) (at box0 f1-4f) (clear f1-3f)
   goals met: 0 of 2
4. (push f1-3f f1-4f f1-5f right box0)
   deleted: (at-robot f1-3f) (at box0 f1-4f) (clear f1-5f)
   added: (at-robot f1-4f) (at box0 f1-5f) (clear f1-4f)
   goals met: 0 of 2
5. (push f1-4f f1-5f f1-6f right box0)
   deleted: (at-robot f1-4f) (at box0 f1-5f) (clear f1-6f)
   added: (at-robot f1-5f) (at box0 f1-6f) (clear f1-5f)
   goals met: 0 of 2
6. (move f1-5f f2-5f down)
   deleted: (at-robot f1-5f)
   added: (at-robot f2-5f)
   goals met: 0 of 2
7. (move f2-5f f2-4f left)
   deleted: (at-robot f2-5f)
   added: (at-robot f2-4f)
   goals met: 0 of 2
8. (move f2-4f f2-3f left)
   deleted: (at-robot f2-4f)
   added: (at-robot f2-3f)
   goals met: 0 of 2
9. (move f2-3f f3-3f down)
   deleted: (at-robot f2-3f)
   added: (at-robot f3-3f)
   goals met: 0 of 2
10. (push f3-3f f3-4f f3-5f right box1)
   deleted: (at-robot f3-3f) (at box1 f3-4f) (clear f3-5f)
   added: (at-robot f3-4f) (at box1 f3-5f) (clear f3-4f)
   goals met: 0 of 2
11. (push f3-4f f3-5f f3-6f right box1)
   deleted: (at-robot f3-4f) (at box1 f3-5f) (clear f3-6f)
   added: (at-robot f3-5f) (at box1 f3-6f) (clear f3-5f)
   goals met: 0 of 2
12. (move f3-5f f2-5f up)
   deleted: (at-robot f3-5f)
   added: (at-robot f2-5f)
   goals met: 0 of 2
13. (move f2-5f f2-6f right)
   deleted: (at-robot f2-5f)
   added: (at-robot f2-6f)
   goals met: 0 of 2
14. (push f2-6f f3-6f f4-6f down box1)
   deleted: (at-robot f2-6f) (at box1 f3-6f) (clear f4-6f)
   added: (at-robot f3-6f) (at box1 f4-6f) (clear f3-6f)
   goals met: 0 of 2
15. (push f3-6f f4-6f f5-6f down box1)
   deleted: (at-robot f3-6f) (at box1 f4-6f) (clear f5-6f)
   added: (at-robot f4-6f) (at box1 f5-6f) (clear f4-6f)
   goals met: 0 of 2
16. (push f4-6f f5-6f f6-6f down box1)
   deleted: (at-robot f4-6f) (at box1 f5-6f) (clear f6-6f)
   added: (at-robot f5-6f) (at box1 f6-6f) (clear f5-6f)
   goals met: 1 of 2
17. (move f5-6f f4-6f up)
   deleted: (at-robot f5-6f)
   added: (at-robot f4-6f)
   goals met: 1 of 2
18. (move f4-6f f4-5f left)
   deleted: (at-robot f4-6f)
   added: (at-robot f4-5f)
   goals met: 1 of 2
19. (move f4-5f f3-5f up)
   deleted: (at-robot f4-5f)
   added: (at-robot f3-5f)
   goals met: 1 of 2
20. (move f3-5f f2-5f up)
   deleted: (at-robot f3-5f)
   added: (at-robot f2-5f)
   goals met: 1 of 2
21. (move f2-5f f1-5f up)
   deleted: (at-robot f2-5f)
   added: (at-robot f1-5f)
   goals met: 1 of 2
22. (move f1-5f f0-5f up)
   deleted: (at-robot f1-5f)
   added: (at-robot f0-5f)
   goals met: 1 of 2
23. (move f0-5f f0-6f right)
   deleted: (at-robot f0-5f)
   added: (at-robot f0-6f)
   goals met: 1 of 2
24. (push f0-6f f1-6f f2-6f down box0)
   deleted: (at-robot f0-6f) (at box0 f1-6f) (clear f2-6f)
   added: (at-robot f1-6f) (at box0 f2-6f) (clear f1-6f)
   goals met: 1 of 2
25. (push f1-6f f2-6f f3-6f down box0)
   deleted: (at-robot f1-6f) (at box0 f2-6f) (clear f3-6f)
   added: (at-robot f2-6f) (at box0 f3-6f) (clear f2-6f)
   goals met: 1 of 2
26. (push f2-6f f3-6f f4-6f down box0)
   deleted: (at-robot f2-6f) (at box0 f3-6f) (clear f4-6f)
   added: (at-robot f3-6f) (at box0 f4-6f) (clear f3-6f)
   goals met: 1 of 2
27. (push f3-6f f4-6f f5-6f down box0)
   deleted: (at-robot f3-6f) (at box0 f4-6f) (clear f5-6f)
   added: (at-robot f4-6f) (at box0 f5-6f) (clear f4-6f)
   goals met: 2 of 2
